// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let x;
x = Math.floor(Math.random() * 101); // згенеруємо число від 0 до 100
let y;
y = Math.floor(Math.random() * 101); // згенеруємо число від 0 до 100
console.log(" x="+x+" y="+y);
if (x>y) {
        console.log(" x="+x+' більше y='+y);
    }
else if (x < y) {
    console.log(" x="+x+' менььше y='+y);
}
else if (x === y) {
    console.log(" x="+x+' рівняеться y='+y);
}
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
x = (Math.floor(Math.random() * 90)) + 1; // згенеруємо число від 1 до 90
console.log(" Квартира №"+x);
if (x > 48) {
    console.log(" У третьому під'їзді");
}
else if (x > 21) {
    console.log(" У другому під'їзді");
}
else if ( x < 21) {
    console.log(" У першому під'їзді");
}
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = parseInt(prompt('Введіть число 10'),10);
(number !== 10) ? console.log("Невірно") : console.log("Вірно");
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3. // якщо в змінну записали щось інше, спрацьовує else
// x = prompt('Введіть щось ');
//document.write(x);  document.write(" Тип змінної "+(typeof (x)) + "<br/>"); //
//x=0;
//x="0";
//x=true;
x=[1,2];
//x=undefined;
let type = typeof(x); console.log(type);
if (type === "number") {
    console.log("1");
}
else if (type === "string") {
    console.log("2");
}
else if (type === "boolean") {
    console.log("3");
}
else if (type === "object") {
    console.log("4");
} else {
    console.log("5");
}
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
x = (Math.floor(Math.random() * 81)) - 40; // згенеруємо число від -40 до 40
console.log(" Температура "+x);
if (x < 23 && x > 9) {
    console.log(" Ми йдемо ВЧИТИСЯ");
}
else {
    console.log(" Сидимо вдома і вчимося ОНЛАЙН");
}
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
number = prompt('Введіть число ');
console.log(number);
switch (number) {
    case "1":
        console.log('Молодець, візьми цукерочку!');
        break;
    case "2":
        console.log('Молодець, візьми дві цукерочки!');
        break;
    case "3":
        console.log('Молодець, візьми три цукерочки!');
        break;
    case "4":
        console.log('Молодець, візьми чотирі цукерочки!');
        break;
    case "5":
        console.log('Молодець, візьми пиріжок!');
        break;
    default:
        console.log("Спробуй ще раз");
}
